# Dataset: Customer Churn (intentionally messy) 
#### Missing age values 
#### Duplicate rows 
#### Inconsistent gender formats 
#### Salary outliers 
# Task: 
#### “Clean this dataset so it is ready for machine learning.”

In [1]:
import pandas as pd
import numpy as np

# Load dataset
df = pd.read_csv("customer_churn_messy.csv")
df

    CustomerID   Age  Gender   Salary Churn
0          101  25.0    Male    40000    No
1          102   NaN  FEMALE    42000   Yes
2          103  35.0  female    39000    No
3          104  45.0       M  1200000    No
4          105  28.0    male    41000   Yes
5          106  35.0       F    39000    No
6          107  35.0       F    39000    No
7          108   NaN    Male    38000   Yes
8          109  52.0  Female    45000    No
9          110  23.0    Male    37000   Yes
10         111  29.0    MALE  9999999    No
11         112  41.0  female    43000    No
12         113  38.0       F    44000   Yes
13         114   NaN       m    40000    No
14         115  34.0  FEMALE    41000   Yes
15         116  35.0       F    39000    No
16         116  35.0       F    39000    No
17         117  27.0       M    36000   Yes
18         118  48.0  Female    47000    No
19         119  31.0    MALE    39000   Yes
20         120   NaN  female    42000    No

In [2]:
df.head()

   CustomerID   Age  Gender   Salary Churn
0         101  25.0    Male    40000    No
1         102   NaN  FEMALE    42000   Yes
2         103  35.0  female    39000    No
3         104  45.0       M  1200000    No
4         105  28.0    male    41000   Yes

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  21 non-null     int64
 1   Age         17 non-null     float64
 2   Gender      21 non-null     object
 3   Salary      21 non-null     int64
 4   Churn       21 non-null     object
dtypes: float64(1), int64(2), object(2)
memory usage: 972.0+ bytes

In [4]:
df.isnull().sum()

CustomerID    0
Age           4
Gender        0
Salary        0
Churn         0
dtype: int64

In [5]:
df.describe()

       CustomerID        Age        Salary
count   21.000000  17.000000  2.100000e+01
mean   110.761905  35.058824  5.700000e+05
std      5.889862   7.956684  2.175413e+06
min    101.000000  23.000000  3.600000e+04
25%    106.000000  29.000000  3.900000e+04
50%    111.000000  35.000000  4.000000e+04
75%    116.000000  38.000000  4.300000e+04
max    120.000000  52.000000  9.999999e+06

# Remove Duplicate Rows

In [6]:
df = df.drop_duplicates()

In [7]:
df

    CustomerID   Age  Gender   Salary Churn
0          101  25.0    Male    40000    No
1          102   NaN  FEMALE    42000   Yes
2          103  35.0  female    39000    No
3          104  45.0       M  1200000    No
4          105  28.0    male    41000   Yes
5          106  35.0       F    39000    No
6          107  35.0       F    39000    No
7          108   NaN    Male    38000   Yes
8          109  52.0  Female    45000    No
9          110  23.0    Male    37000   Yes
10         111  29.0    MALE  9999999    No
11         112  41.0  female    43000    No
12         113  38.0       F    44000   Yes
13         114   NaN       m    40000    No
14         115  34.0  FEMALE    41000   Yes
15         116  35.0       F    39000    No
17         117  27.0       M    36000   Yes
18         118  48.0  Female    47000    No
19         119  31.0    MALE    39000   Yes
20         120   NaN  female    42000    No

# Handle Missing Values

In [8]:
mean_age = df["Age"].mean()
df["Age"] = df["Age"].fillna(mean_age)
df.isnull().sum()

C:\Users\gitan\AppData\Local\Temp\ipykernel_19604\3737201080.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Age"] = df["Age"].fillna(mean_age)

CustomerID    0
Age           0
Gender        0
Salary        0
Churn         0
dtype: int64

# Fix inconsistent Gender values

In [9]:
df["Gender"] = df["Gender"].str.lower()

df["Gender"] = df["Gender"].replace({
    "m": "male",
    "f": "female"
})

C:\Users\gitan\AppData\Local\Temp\ipykernel_19604\4128421267.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Gender"] = df["Gender"].str.lower()
C:\Users\gitan\AppData\Local\Temp\ipykernel_19604\4128421267.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Gender"] = df["Gender"].replace({

In [10]:
df

    CustomerID      Age  Gender   Salary Churn
0          101  25.0000    male    40000    No
1          102  35.0625  female    42000   Yes
2          103  35.0000  female    39000    No
3          104  45.0000    male  1200000    No
4          105  28.0000    male    41000   Yes
5          106  35.0000  female    39000    No
6          107  35.0000  female    39000    No
7          108  35.0625    male    38000   Yes
8          109  52.0000  female    45000    No
9          110  23.0000    male    37000   Yes
10         111  29.0000    male  9999999    No
11         112  41.0000  female    43000    No
12         113  38.0000  female    44000   Yes
13         114  35.0625    male    40000    No
14         115  34.0000  female    41000   Yes
15         116  35.0000  female    39000    No
17         117  27.0000    male    36000   Yes
18         118  48.0000  female    47000    No
19         119  31.0000    male    39000   Yes
20         120  35.0625  female    42000    No

# Handle Salary outliers using IQR

In [11]:
Q1 = df["Salary"].quantile(0.25)
Q3 = df["Salary"].quantile(0.75)
IQR = Q3 - Q1

lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

df = df[(df["Salary"] >= lower_bound) & (df["Salary"] <= upper_bound)]

In [12]:
df

    CustomerID      Age  Gender  Salary Churn
0          101  25.0000    male   40000    No
1          102  35.0625  female   42000   Yes
2          103  35.0000  female   39000    No
4          105  28.0000    male   41000   Yes
5          106  35.0000  female   39000    No
6          107  35.0000  female   39000    No
7          108  35.0625    male   38000   Yes
8          109  52.0000  female   45000    No
9          110  23.0000    male   37000   Yes
11         112  41.0000  female   43000    No
12         113  38.0000  female   44000   Yes
13         114  35.0625    male   40000    No
14         115  34.0000  female   41000   Yes
15         116  35.0000  female   39000    No
17         117  27.0000    male   36000   Yes
18         118  48.0000  female   47000    No
19         119  31.0000    male   39000   Yes
20         120  35.0625  female   42000    No

In [14]:
df.isnull().sum()

CustomerID    0
Age           0
Gender        0
Salary        0
Churn         0
dtype: int64

In [15]:
df

    CustomerID      Age  Gender  Salary  Churn
0          101  25.0000       0   40000      0
1          102  35.0625       1   42000      1
2          103  35.0000       1   39000      0
4          105  28.0000       0   41000      1
5          106  35.0000       1   39000      0
6          107  35.0000       1   39000      0
7          108  35.0625       0   38000      1
8          109  52.0000       1   45000      0
9          110  23.0000       0   37000      1
11         112  41.0000       1   43000      0
12         113  38.0000       1   44000      1
13         114  35.0625       0   40000      0
14         115  34.0000       1   41000      1
15         116  35.0000       1   39000      0
17         117  27.0000       0   36000      1
18         118  48.0000       1   47000      0
19         119  31.0000       0   39000      1
20         120  35.0625       1   42000      0

# Save cleaned dataset

In [16]:
df.to_csv("customer_churn_cleaned.csv", index=False)

In [17]:
df

    CustomerID      Age  Gender  Salary  Churn
0          101  25.0000       0   40000      0
1          102  35.0625       1   42000      1
2          103  35.0000       1   39000      0
4          105  28.0000       0   41000      1
5          106  35.0000       1   39000      0
6          107  35.0000       1   39000      0
7          108  35.0625       0   38000      1
8          109  52.0000       1   45000      0
9          110  23.0000       0   37000      1
11         112  41.0000       1   43000      0
12         113  38.0000       1   44000      1
13         114  35.0625       0   40000      0
14         115  34.0000       1   41000      1
15         116  35.0000       1   39000      0
17         117  27.0000       0   36000      1
18         118  48.0000       1   47000      0
19         119  31.0000       0   39000      1
20         120  35.0625       1   42000      0